Управление_пожарной_частью_/src/Documents/ПроверкаНормативов/ПроверкаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроверкаНормативов</name>
  <registerRecords>InformationRegister.РезультатВыполненияУпражнений</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Начальник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/InformationRegisters/РезультатВыполненияУпражнений/РезультатВыполненияУпражнений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатВыполненияУпражнений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </resources>
  <resources>
    <name>ВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.ВозрастныеГруппы</types>
    </type>
  </resources>
  <resources>
    <name>МинимальноеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Норматив</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_пожарной_частью_/src/Documents/ПроверкаНормативов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр РезультатВыполненияУпражнений
	Движения.РезультатВыполненияУпражнений.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы из Нормативы Цикл
		Движение = Движения.РезультатВыполненияУпражнений.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ФизЛицо = ТекСтрокаНормативы.ФизЛицо;
		Движение.Норматив = ТекСтрокаНормативы.Норматив;
		Движение.ДатаПроведения = Дата;
		Движение.Результат = ТекСтрокаНормативы.Результат;

		ВозрастнаяГруппа = УправлениеНормативами.ОпределитьВозрастнуюГруппу(ТекСтрокаНормативы.ФизЛицо, Дата);
		Если ВозрастнаяГруппа = Неопределено Тогда
			Сообщить("Не определена возрастная группа для: " + ТекСтрокаНормативы.ФизЛицо);
			Продолжить;
		КонецЕсли;
		
		НайденныеНормативы = УправлениеНормативами.НайтиНорматив(ТекСтрокаНормативы.Норматив, ВозрастнаяГруппа, Дата);
		Если НайденныеНормативы.Количество() = 0 Тогда
			Сообщить("Не найдены нормативы для: " + ТекСтрокаНормативы.Норматив);
			Продолжить;
		КонецЕсли;
		
		Оценка = УправлениеНормативами.РассчитатьОценку(ТекСтрокаНормативы.Результат, НайденныеНормативы);
		
		НормативДляОценки = УправлениеНормативами.ПолучитьНормативПоОценке(НайденныеНормативы, Оценка);
		
		Движение.Оценка = Оценка;
		Движение.ВозрастнаяГруппа = ВозрастнаяГруппа;
		
		Если НормативДляОценки <> Неопределено Тогда
			Движение.МинимальноеЗначение = НормативДляОценки.МинимальноеЗначение;
			Движение.МаксимальноеЗначение = НормативДляОценки.МаксимальноеЗначение;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
